VuongVanNguyen/WasteDetector/WasteDetector_ESP32/src/test_servo.cpp
// Standalone servo test — SG90 (knock) + MG90S (door)
// Flash với: pio run -e test_servo --target upload
// Quan sat:  pio device monitor -e test_servo
//
// Điều chỉnh các góc/thời gian trong config.h nếu cần, sau đó flash lại.

#include <Arduino.h>
#include <ESP32Servo.h>
#include "config.h"

static Servo servoKnock;
static Servo servoDoor;

static void testKnock(int count) {
    Serial.printf("[KNOCK] Gõ %d lần...\n", count);
    for (int i = 1; i <= count; i++) {
        Serial.printf("  lần %d: strike → %d°", i, KNOCK_STRIKE_ANGLE);
        servoKnock.write(KNOCK_STRIKE_ANGLE);
        delay(KNOCK_DWELL_MS);

        Serial.printf(" → rest %d°\n", KNOCK_REST_ANGLE);
        servoKnock.write(KNOCK_REST_ANGLE);
        delay(KNOCK_SETTLE_MS);

        if (i < count) {
            delay(KNOCK_INTERVAL_MS - KNOCK_DWELL_MS - KNOCK_SETTLE_MS);
        }
    }
    Serial.println("[KNOCK] Xong.");
}

static void testDoor() {
    Serial.printf("[DOOR] Mở cửa → %d°\n", DOOR_OPEN_ANGLE);
    servoDoor.write(DOOR_OPEN_ANGLE);
    delay(DOOR_HOLD_MS);

    Serial.printf("[DOOR] Đóng cửa → %d°\n", DOOR_CLOSE_ANGLE);
    servoDoor.write(DOOR_CLOSE_ANGLE);
    delay(DOOR_SETTLE_MS);

    Serial.println("[DOOR] Xong.");
}

void setup() {
    Serial.begin(115200);
    delay(500);
    Serial.println("=== TEST SERVO (SG90 + MG90S) ===");
    Serial.printf("SG90  → GPIO %d | rest=%d° strike=%d°\n",
                  PIN_SERVO_KNOCK, KNOCK_REST_ANGLE, KNOCK_STRIKE_ANGLE);
    Serial.printf("MG90S → GPIO %d | close=%d° open=%d°\n",
                  PIN_SERVO_DOOR, DOOR_CLOSE_ANGLE, DOOR_OPEN_ANGLE);

    ESP32PWM::allocateTimer(0);
    ESP32PWM::allocateTimer(1);

    servoKnock.setPeriodHertz(50);
    servoKnock.attach(PIN_SERVO_KNOCK, 500, 2400);
    servoKnock.write(KNOCK_REST_ANGLE);

    servoDoor.setPeriodHertz(50);
    servoDoor.attach(PIN_SERVO_DOOR, 500, 2400);
    servoDoor.write(DOOR_CLOSE_ANGLE);

    delay(1000);  // cho servo về vị trí ban đầu
}

void loop() {
    Serial.println("\n--- Chu kỳ test mới ---");

    testKnock(3);
    delay(1000);

    testDoor();
    delay(2000);
}
